{
    "id": "officeRental",
    "action": {
        "title": {
            "en": "Tech Campus",
            "de": "Tech Campus"
        },
        "description": {
            "en": "Renting an office at 'Tech Campus' provides a modern workspace with access to the latest technology and in turn allows you to work for <b>more rounds</b>.",
            "de": "Ein Büro bei \"Tech Campus\" zu mieten bedeutet, einen modernen Arbeitsplatz mit Zugang zu neuester Technologie zu erhalten, der es dir ermöglicht, mehr <b>Runden</b> zu arbeiten."
        },
        "image": "OfficeRental"
    },
    "requirements": [
        {
            "type": "unlock"
        }
    ],
    "dialog": [
        {
            "type": "image",
            "background": "OfficeRental",
            "right": "OfficeRental",
            "left": "Player"
        },
        {
            "type": "condition",
            "condition": {
                "type": "flag",
                "key": "officeRentalVisited",
                "value": true
            },
            "if": [
                {
                    "type": "random",
                    "dialogs": [
                        [
                            {
                                "type": "text",
                                "speaker": "right",
                                "text": {
                                    "en": "Christine: It's good to see you again! How do you like your new office? I hope it's helping you to be more productive.",
                                    "de": "Christine: Schön, dich wiederzusehen! Wie gefällt dir dein neues Büro? Ich hoffe, es hilft dir, produktiver zu sein."
                                }
                            },
                            {
                                "type": "text",
                                "speaker": "right",
                                "text": {
                                    "en": "Christine: If you need anything, just let me know. And if you want to prolong your rental, I've got the paper work prepared.",
                                    "de": "Christine: Wenn du etwas brauchst, lass es mich einfach wissen. Und wenn du deine Miete verlängern möchtest, habe ich die Unterlagen vorbereitet."
                                }
                            }
                        ],
                        [
                            {
                                "type": "text",
                                "speaker": "right",
                                "text": {
                                    "en": "Christine: Ah, what a wonderful day. How is business going?",
                                    "de": "Christine: Ah, was für ein wunderbarer Tag. Wie läuft das Geschäft?"
                                }
                            },
                            {
                                "type": "text",
                                "speaker": "left",
                                "text": {
                                    "en": "You: Everything's going great, thanks! Working from the office is really better than working from home.",
                                    "de": "Du: Es läuft alles großartig, danke! Das Arbeiten im Büro ist wirklich besser als das Arbeiten von zu Hause."
                                }
                            },
                            {
                                "type": "text",
                                "speaker": "right",
                                "text": {
                                    "en": "Christine: I bet! Now that you've settled in and appreciate the office, maybe you'd like to extend your rental period?",
                                    "de": "Christine: Auf jeden Fall! Jetzt, wo du dich eingelebt hast und das Büro zu schätzen weißt, möchtest du vielleicht deine Mietdauer verlängern?"
                                }
                            }
                        ]
                    ]
                }
            ],
            "else": [
                {
                    "type": "text",
                    "speaker": "right",
                    "text": {
                        "en": "Christine: Good morning! Welcome to Tech Campus. I'm Christine, the office rental manager here.",
                        "de": "Christine: Guten Morgen! Willkommen im Tech Campus. Ich bin Christine, die Bürovermietungsmanagerin hier."
                    }
                },
                {
                    "type": "text",
                    "speaker": "right",
                    "text": {
                        "en": "Christine: I can see you're taking in the atmosphere. Pretty impressive, isn't it? This building houses some of the most innovative tech companies in the city.",
                        "de": "Christine: Ich sehe, du nimmst die Atmosphäre in dich auf. Ziemlich beeindruckend, nicht wahr? Dieses Gebäude beherbergt einige der innovativsten Tech-Unternehmen der Stadt."
                    }
                },
                {
                    "type": "text",
                    "speaker": "right",
                    "text": {
                        "en": "Christine: We specialize in providing modern, fully-equipped office spaces for freelancers and small businesses like yours.",
                        "de": "Christine: Wir spezialisieren uns darauf, moderne, voll ausgestattete Büroräume für Freelancer und kleine Unternehmen wie deines anzubieten."
                    }
                },
                {
                    "type": "text",
                    "speaker": "right",
                    "text": {
                        "en": "Christine:  Our offices come with high-speed internet, state-of-the-art workstations, and access to our collaborative spaces.",
                        "de": "Christine: Unsere Büros sind mit Highspeed-Internet, hochmodernen Arbeitsplätzen und Zugang zu unseren Gemeinschaftsräumen ausgestattet."
                    }
                },
                {
                    "type": "text",
                    "speaker": "left",
                    "text": {
                        "en": "You: That sounds exactly like what I need. Working from home has its limitations.",
                        "de": "Du: Das klingt genau nach dem, was ich brauche. Das Arbeiten von zu Hause hat seine Grenzen."
                    }
                },
                {
                    "type": "text",
                    "speaker": "right",
                    "text": {
                        "en": "Christine: Absolutely! A professional workspace can significantly boost your productivity.",
                        "de": "Christine: Absolut! Ein professioneller Arbeitsplatz kann deine Produktivität erheblich steigern."
                    }
                },
                {
                    "type": "text",
                    "speaker": "right",
                    "text": {
                        "en": "Christine: The best part? With our flexible rental system, you can extend your time here as your business grows. Would you be interested in renting an office space?",
                        "de": "Christine: Das Beste daran? Mit unserem flexiblen Mietsystem kannst du deine Zeit hier verlängern, während dein Geschäft wächst. Wärst du interessiert, einen Büroraum zu mieten?"
                    }
                },
                {
                    "type": "flag",
                    "key": "officeRentalVisited",
                    "value": true
                },
                {
                    "type": "condition",
                    "condition": {
                        "type": "not",
                        "condition": {
                            "type": "flag",
                            "key": "officeRentalTutorialDone",
                            "value": true
                        }
                    },
                    "if": [
                        {
                            "type": "text",
                            "text": {
                                "en": "Just as Christine finishes explaining, your phone rings. It's Pio calling.",
                                "de": "Gerade als Christine mit ihrer Erklärung fertig ist, klingelt dein Telefon. Pio ruft an."
                            }
                        },
                        {
                            "type": "image",
                            "right": {
                                "image": "PioTutorial",
                                "alignment": "center",
                                "mirror": true
                            }
                        },
                        {
                            "type": "text",
                            "speaker": "right",
                            "text": {
                                "en": "Pio: Hey! I see you've discovered 'Tech Campus'. Christine runs a great operation there - very professional setup.",
                                "de": "Pio: Hey! Ich sehe, du hast den \"Tech Campus\" entdeckt. Christine führt dort einen großartigen Betrieb - sehr professionelle Einrichtung."
                            }
                        },
                        {
                            "type": "text",
                            "speaker": "right",
                            "text": {
                                "en": "Pio: Let me explain how the rental system works: You can purchase additional rounds here to extend your working time. Think of it as buying more productive days.",
                                "de": "Pio: Lass mich erklären, wie das Mietsystem funktioniert: Du kannst hier zusätzliche Runden kaufen, um deine Arbeitszeit zu verlängern. Stell es dir vor wie den Kauf von produktiveren Tagen."
                            }
                        },
                        {
                            "type": "text",
                            "speaker": "right",
                            "text": {
                                "en": "Pio: There's a downside though: Each time you purchase rounds, the price increases. Early rounds are cheaper, but as demand grows, so does the cost.",
                                "de": "Pio: Es gibt nur ein kleines Problem: Jedes Mal, wenn du Runden kaufst, steigt der Preis. Frühe Runden sind günstiger, aber mit steigender Nachfrage steigen auch die Kosten."
                            }
                        },
                        {
                            "type": "text",
                            "speaker": "right",
                            "text": {
                                "en": "Pio: Yes, the people at 'Tech Campus' provide a great environment, but are still greedy entrepreneurs. So plan wisely!",
                                "de": "Pio: Also ja, die Leute im \"Tech Campus\" bieten eine großartige Umgebung, sind aber immer noch gierige Unternehmer. Also plane weise!"
                            }
                        },
                        {
                            "type": "image",
                            "right": "OfficeRental"
                        },
                        {
                            "type": "flag",
                            "key": "officeRentalTutorialDone",
                            "validity": "Permanent",
                            "value": true
                        }
                    ]
                }
            ]
        },
        {
            "type": "select",
            "showUI": true,
            "selectType": "Cards",
            "title": {
                "en": "Select a bonus",
                "de": "Wähle einen Bonus"
            },
            "options": [
                {
                    "title": {
                        "en": "Haggle",
                        "de": "Feilschen"
                    },
                    "description": {
                        "en": "It's too expensive! Negotiate and hope for a better deal next time.",
                        "de": "Das ist zu teuer! Feilsche und hoffe auf einen besseren Deal beim nächsten Mal."
                    },
                    "image": "Haggle",
                    "cost": {},
                    "dialog": [
                        {
                            "type": "text",
                            "speaker": "left",
                            "text": {
                                "en": "You: Wow, that's quite a price... I don't think I can afford that right now.",
                                "de": "Du: Wow, das ist ganz schön teuer... Ich glaube, ich kann mir das gerade nicht leisten."
                            }
                        },
                        {
                            "type": "text",
                            "speaker": "left",
                            "text": {
                                "en": "You: Isn't there a way to get a discount?",
                                "de": "Du: Gibt es keinen Weg, einen Rabatt zu bekommen?"
                            }
                        },
                        {
                            "type": "text",
                            "speaker": "right",
                            "text": {
                                "en": "Christine: There may be some room to do something. If you take a slightly smaller package, I might be able to offer you a discount.",
                                "de": "Christine: Es könnte Spielraum für Verhandlungen geben. Wenn du ein etwas kleineres Paket wählst, könnte ich dir einen Rabatt anbieten."
                            }
                        },
                        {
                            "type": "text",
                            "speaker": "right",
                            "text": {
                                "en": "Christine: I'll prepare something and should have a better offer for you next time.",
                                "de": "Christine: Ich werde etwas vorbereiten und sollte beim nächsten Mal ein besseres Angebot für dich haben."
                            }
                        },
                        {
                            "type": "text",
                            "speaker": "left",
                            "text": {
                                "en": "You: Thank you! That sounds great.",
                                "de": "Du: Vielen Dank! Das klingt großartig."
                            }
                        },
                        {
                            "type": "flag",
                            "key": "roundsBought",
                            "value": -1,
                            "operation": "Increment"
                        }
                    ]

                },
                {
                    "type": "file",
                    "file": "Options/RoundsPurchase",
                    "title": {
                        "en": "Short Term Rental",
                        "de": "Kurzzeitmiete"
                    },
                    "image": "RoundsSmall",
                    "amount": 1
                },
                {
                    "type": "file",
                    "file": "Options/RoundsPurchase",
                    "title": {
                        "en": "Medium Term Rental",
                        "de": "Mittelfristige Miete"
                    },
                    "image": "RoundsMedium",
                    "amount": 2
                },
                {
                    "type": "file",
                    "file": "Options/RoundsPurchase",
                    "title": {
                        "en": "Long Term Rental",
                        "de": "Langzeitmiete"
                    },
                    "image": "RoundsLarge",
                    "amount": 4
                }
            ]
        }        
    ]
}